<?php
/**
 * [English [En]]
 * @package cBB QuickQuote
 * @version 1.0.3 15/01/2023
 *
 * @copyright (c) 2023 CaniDev
 * @license https://creativecommons.org/licenses/by-nc/4.0/
 */

// DO NOT CHANGE
if(!defined('IN_PHPBB'))
{
	exit;
}

if(empty($lang) || !is_array($lang))
{
	$lang = [];
}

$lang = array_merge($lang, [
	'ACP_CAT_QUICKQUOTE'			=> 'Γρήγορη Παράθεση',
	'ACP_QUICKQUOTE_CONFIG'			=> 'Επιλογές',
	'ACP_QUICKQUOTE_CONFIG_EXPLAIN'	=> 'Από εδώ μπορείτε να επεξεργαστείτε τις βασικές επιλογές αυτής της επέκτασης.',
	
	'MAIN_OPTIONS'					=> 'Κύριες επιλογές',
	'QUICKQUOTE_FLOATBTN'			=> 'Μετακινούμενο κουμπί',
	'QUICKQUOTE_FLOATBTN_EXPLAIN'	=> 'Αν ενεργοποιηθεί, ένα κουμπί θα εμφανιστεί στο κάτω μέρος όλων των επιτρεπόμενων σελίδων το οποίο θα δείχνει τις αποθηκευμένες παραθέσεις.
		<br />Διαφορετικά, ένα κουμπί θα εμφανιστεί στον επεξεργαστή κειμένου για να εισάγετε τις παραθέσεις.',
	'QUICKQUOTE_GROUPS'				=> 'Εξουσιοδοτηθέντα γκρουπ',
	'QUICKQUOTE_GROUPS_EXPLAIN'		=> 'Ορίστε τα γκρουπ που μπορούν να χρησιμοποιούν αυτή την επέκταση.<br />
		Μπορείτε να επιλέξετε ΄πολλά γκρουπ χρησιμοποιώντας το πλήκτρο <em>Ctrl</em> του πληκτρολογίου σας.<br /><br />
		<em>Πέρα από αυτή την παράμετρο, η χρήση της επέκτασης αυτής θα καθοριστεί και από τις προσβάσεις των δημοσίευσης μηνυμάτων.</em>',
	'QUICKQUOTE_REPLY_OVERWRITE'			=> 'Αντικατέστησε το κείμενο της απάντησης',
	'QUICKQUOTE_REPLY_OVERWRITE_EXPLAIN'	=> 'Η επιλογή αυτή καθορίζει αν το ήδη γραμμένο κείμενο της γρήγορης απάντησης θα αντικατασταθεί χρησιμοποιώντας το πλήκτρο <em>Reply</em>.<br />
		Αν επιλεγεί το "No" η παράθεση θα εισαχθεί στο τέλος του κειμένου.',
]);
